diapos/Tarea_Radiacion.tex
% Created 2023-01-08 dom 16:24
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\usepackage{mathpazo}
\author{Oscar Perpiñán Lamigueiro}
\date{}
\title{Actividad: cálculo de radiación\\\medskip
\large Energía Solar Fotovoltaica}
\hypersetup{
 pdfauthor={Oscar Perpiñán Lamigueiro},
 pdftitle={Actividad: cálculo de radiación},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
En esta actividad vas a estimar las medias mensuales de la radiación global incidente en el plano horizontal y en el plano de un generador.

Para el cálculo de la \textbf{radiación en el plano horizontal} seguiremos el siguiente itinerario:

\begin{enumerate}
\item Obtén series temporales de \textbf{medidas diarias} de radiación solar de 3 estaciones meteorológicas (recomendable longitud de 10 años).
\item Filtra cada serie empleando límites físicos.
\item Obtén una serie temporal \textbf{diaria} representativa de la región calculando la media de las tres series temporales.
\item Compara esta serie temporal media con las series temporales de cada estación usando métricas estadísticas (MBD, RMSD, MAD).
\item Elige una localización dentro del perímetro definido por las tres estaciones. Obtén las \textbf{12 medias mensuales} en esta localización empleando interpolación espacial (IDW) a partir de las \textbf{12 medias mensuales} de la radiación filtrada de cada estación (punto 2)
\item Obtén medias temporales de radiación solar de un servicio satelital (preferiblemente CMSAF,  empleando QGis o software similar) para una región que cubra las tres estaciones\footnote{Los datos de radiación proporcionados por CMSAF son medias diarias de \textbf{irradiancia} (\(W/m^2\)). Por tanto, debes multiplicarlos por 24 para obtener valores diarios de \textbf{irradiación}.}.
\item Compara las medias mensuales de las tres estaciones con las estimaciones satelitales empleando métricas estadísticas.
\item Combina la estimación satelital en la localización del punto 5 con las medias mensuales obtenidas en ese punto.
\end{enumerate}

A continuación, realizaremos el cálculo de la \textbf{radiación en el plano del generador}. Este generador está localizado en el hemisferio norte, orientado al sur y con una inclinación de 30º. Seguiremos el siguiente itinerario:

\begin{enumerate}
\item En la localización elegida en el punto 5 anterior, calcula la declinación, duración del día, e irradiación extra-atmosférica diaria en el plano horizontal \textbf{para los días promedio}.
\item Calcula el índice de claridad y fracción de difusa para las 12 medias mensuales obtenidas en el punto 8 (o, en su defecto, punto 5). Con estos parámetros obtén las medias mensuales de irradiación difusa y directa diarias en el plano horizontal.
\item Calcula el coseno del ángulo cenital y el coseno del ángulo de incidencia para cada día promedio (mes). Deberías obtener 24 valores por día (un total de 12·24=288 valores por parámetro).
\item Calcula los perfiles intradiaarios rd y rg para cada dia promedio (mes). Deberías obtener 24 valores por mes (un total de 12·24=288 valores por parámetro).
\item Obtén los perfiles de irradiancia difusa, global y diaria para cada día promedio (mes). Deberías obtener 24 valores por mes (un total de 12·24=288 valores por componente).
\item Obtén la irradiancia en el plano del generador realizando la transformación de los valores del punto 12 del plano horizontal al plano del generador.
\item Suma los resultados del paso anterior para obtener las 12 medias mensuales de radiación diaria (global, difusa y directa) en el plano del generador. Comprueba que estos resultados son superiores a los valores de la radiación en el plano horizontal.
\end{enumerate}
\end{document}